Конфигурация/Reports/ЖурналПередачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Report>
		<Properties>
			<Name>ЖурналПередачи</Name>
		</Properties>
	</Report>
</MetaDataObject>

Конфигурация/Enums/РазделыОтчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Enum>
		<Properties>
			<Name>РазделыОтчетов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВнутренниеДокументыСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВходящиеДокументыСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДелаТомаСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЖурналПередачиСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗадачиМнеСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗадачиОтделаСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗадачиСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсходящиеДокументыСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрольСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтрагентыСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МероприятияСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МониторингПроцессовСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбращенияГражданСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПисьмаСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭскалацияЗадач</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроектыСписок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцессыСписок</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Reports/ЖурналПередачи/Ext/ManagerModule.bsl
#Область НастройкиОтчетаПоУмолчанию

//Выполняет заполнение категорий и разделов в зависимости от варианта отчета
//Параметры:КлючВариантаОтчета - Строковое название варианта отчета
//			СписокКатегорий - в список добавляются необходимые категории
//			СписокРазделов - в список добавляются необходимые категории
Процедура ЗаполнитьСписокКатегорийИРазделовОтчета(КлючВариантаОтчета, СписокКатегорий, СписокРазделов) Экспорт
	
	СписокРазделов.Добавить(ОбщегоНазначения.ИдентификаторОбъектаМетаданных(
			Метаданные.Подсистемы.ДокументыИФайлы));
			
	Если КлючВариантаОтчета = "ДокументыУИсполнителей" Тогда
		
		СписокРазделов.Добавить(Перечисления.РазделыОтчетов.ЖурналПередачиСписок);
		
		СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.ПоИсполнителям);
		СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.ПоДокументам);
		
	ИначеЕсли КлючВариантаОтчета = "ДокументыНеВозвращенныеВСрок" Тогда
		
		СписокРазделов.Добавить(Перечисления.РазделыОтчетов.ЖурналПередачиСписок);
		
		СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.ПоИсполнителям);
		СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.ПоДокументам);
		СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.Просроченное);
		СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.КонтрольныеОтчеты);
		
	ИначеЕсли КлючВариантаОтчета = "ДокументыУКонтрагентов" Тогда
		
		СписокРазделов.Добавить(Перечисления.РазделыОтчетов.КонтрагентыСписок);
		СписокРазделов.Добавить(Перечисления.РазделыОтчетов.ЖурналПередачиСписок);
		
		СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.ПоКонтрагентам);
		СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.ПоДокументам);
		
	ИначеЕсли КлючВариантаОтчета = "ДокументыНеВозвращенныеВСрокКонтрагентами" Тогда
		
		СписокРазделов.Добавить(Перечисления.РазделыОтчетов.ЖурналПередачиСписок);
		СписокРазделов.Добавить(Перечисления.РазделыОтчетов.КонтрагентыСписок);
			
		СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.ПоКонтрагентам);
		СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.ПоДокументам);
		СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.Просроченное);
		СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.КонтрольныеОтчеты);
		
	ИначеЕсли КлючВариантаОтчета = "СотрудникиЧастоЗадерживающиеДокументы" Тогда
		
		СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.ПоИсполнителям);
		СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.ПоДокументам);
		СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.Статистические);
		
	ИначеЕсли КлючВариантаОтчета = "КонтрагентыЧастоЗадерживающиеДокументы" Тогда
		
		СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.ПоКонтрагентам);
		СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.ПоДокументам);
		СписокКатегорий.Добавить(Справочники.КатегорииОтчетов.Статистические);
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти
